# Credit One Risk Management
### Author: Marco Isaac Marín Granados - Cohort 204

## Task 2

Based on the presentation delivered in the Task 1, the general objectives of this investigation are: 
1. Detect variables that can correlate with the risk of a credit to become a default.
2. Develop  and evaluate models capable to classify if a credit will become default.
3. Implement and rank regression models for predicting the appropiate amount of credit limit.

Particularly in this notebook it will be developed the first of the objectives, and by identifying the appropiate variables, it will be possible to implement the second and third objectives.

The first stage of this Notebook illustrates the process along which the data provided by Credit One is cleaned and prepared to be used for an EDA in a later section.

In [1]:
#Libraries
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt

import pandas_profiling

In [2]:
#Extract data from SQL DB of Credit One
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'
db_connection = create_engine(db_connection_str)
df = pd.read_sql('SELECT * FROM credit', con=db_connection)

#The data is stored in case that the source is not available later
df.to_csv('rawDataCreditOne.csv', index=False)
df

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30199,29996,220000,male,high school,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
30200,29997,150000,male,high school,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,not default
30201,29998,30000,male,university,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
30202,29999,80000,male,high school,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
30203,30000,50000,male,university,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

### Data cleaning

It can be seen that the row 0 contains useful headers, which are more descriptive than the default labels. The column names will be replaced.

In [3]:
#Fix the header mismatch
header_row = 0
df.columns = df.iloc[header_row]
df = df.drop(header_row)
df

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30199,29996,220000,male,high school,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
30200,29997,150000,male,high school,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,not default
30201,29998,30000,male,university,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
30202,29999,80000,male,high school,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
30203,30000,50000,male,university,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

From looking to the indexes of column "ID", and the actual index of the dataframe, it can be seen that the numbers don't match. Probably there are repeated rows.

In [4]:
df = df.drop(df[df.duplicated()].index)
df

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30199,29996,220000,male,high school,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
30200,29997,150000,male,high school,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,not default
30201,29998,30000,male,university,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
30202,29999,80000,male,high school,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
30203,30000,50000,male,university,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

Even there were removed the repeated records, there are still 2 extra records. This can be seen from the mismatch in the maximum ID in the ID column, and the amount of rows in the dataframe.
It was seen that the root of this problem is that also the first dataset headers (X1, X2, ...), and the verbose headers (PAY_0, PAY_1, ...) were also being repeated. They will be dropped.

In [5]:
df = df.drop(df[(df['ID'] == '') | (df['ID'] == 'ID')].index)
df

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30199,29996,220000,male,high school,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
30200,29997,150000,male,high school,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,not default
30201,29998,30000,male,university,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
30202,29999,80000,male,high school,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
30203,30000,50000,male,university,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

In [6]:
df = df.drop(columns=['ID'])
df

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,20000,female,university,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,default
2,120000,female,university,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,90000,female,university,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,50000,female,university,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,50000,male,university,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30199,220000,male,high school,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
30200,150000,male,high school,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,not default
30201,30000,male,university,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
30202,80000,male,high school,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
30203,50000,male,university,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

In [7]:
df.columns

Index(['LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_0', 'PAY_2',
       'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object', name=0)

In [8]:
df = df.rename(columns={'PAY_0': 'PAY_1', 'default payment next month':'DEFAULT'})
df

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,DEFAULT
1,20000,female,university,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,default
2,120000,female,university,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,90000,female,university,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,50000,female,university,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,50000,male,university,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30199,220000,male,high school,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
30200,150000,male,high school,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,not default
30201,30000,male,university,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
30202,80000,male,high school,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
30203,50000,male,university,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

In [9]:
numericCols = ['LIMIT_BAL', 'MARRIAGE', 'AGE', 'PAY_1', 'PAY_2',
       'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6']
df[numericCols] = df[numericCols].apply(pd.to_numeric, axis=1)
df

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,DEFAULT
1,20000,female,university,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,default
2,120000,female,university,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,90000,female,university,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,50000,female,university,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,50000,male,university,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30199,220000,male,high school,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
30200,150000,male,high school,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,not default
30201,30000,male,university,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
30202,80000,male,high school,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
30203,50000,male,university,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

The columns were checked to make sure that the data contained in the numeric variables is actually all numeric, and there is no extra incoherent data.

In [10]:
df = df.reset_index(drop=True)
df

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,DEFAULT
0,20000,female,university,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,default
1,120000,female,university,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,90000,female,university,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,50000,female,university,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,50000,male,university,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,220000,male,high school,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
29996,150000,male,high school,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,not default
29997,30000,male,university,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
29998,80000,male,high school,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
29999,50000,male,university,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

In [11]:
#Cells renaming
#PAY
names = {"PAY_1":"PAY_SEP",
         "PAY_2":"PAY_AUG",
         "PAY_3":"PAY_JUL",
         "PAY_4":"PAY_JUN",
         "PAY_5":"PAY_MAY",
         "PAY_6":"PAY_APR",}
df.rename(columns=names, inplace=True)
#BILL_AMT
names = {"BILL_AMT1":"BIL_AMT_SEP",
         "BILL_AMT2":"BIL_AMT_AUG",
         "BILL_AMT3":"BIL_AMT_JUL",
         "BILL_AMT4":"BIL_AMT_JUN",
         "BILL_AMT5":"BIL_AMT_MAY",
         "BILL_AMT6":"BIL_AMT_APR",}
df.rename(columns=names, inplace=True)
#Pay_amt
names = {"PAY_AMT1":"PAY_AMT_SEP",
         "PAY_AMT2":"PAY_AMT_AUG",
         "PAY_AMT3":"PAY_AMT_JUL",
         "PAY_AMT4":"PAY_AMT_JUN",
         "PAY_AMT5":"PAY_AMT_MAY",
         "PAY_AMT6":"PAY_AMT_APR",}
df.rename(columns=names, inplace=True)
df

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_SEP,PAY_AUG,PAY_JUL,PAY_JUN,PAY_MAY,...,BIL_AMT_JUN,BIL_AMT_MAY,BIL_AMT_APR,PAY_AMT_SEP,PAY_AMT_AUG,PAY_AMT_JUL,PAY_AMT_JUN,PAY_AMT_MAY,PAY_AMT_APR,DEFAULT
0,20000,female,university,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,default
1,120000,female,university,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,90000,female,university,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,50000,female,university,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,50000,male,university,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,220000,male,high school,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
29996,150000,male,high school,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,not default
29997,30000,male,university,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
29998,80000,male,high school,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
29999,50000,male,university,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

In [12]:
pandas_profiling.ProfileReport(df)

## Creation of dummy variables (one-hot encoding) for categorical variables.

In [13]:
# Replace numbers for MARRIAGE for verbose indicators
marriageDict = {0:'others',
                1: 'married',
                2: 'single',
                3: 'divorce'}
for k, v in marriageDict.items():
    df.loc[df['MARRIAGE'] == k, 'MARRIAGE'] = v
df.iloc[0]

LIMIT_BAL                      20000
AGE                               24
PAY_SEP                            2
PAY_AUG                            2
PAY_JUL                           -1
PAY_JUN                           -1
PAY_MAY                           -2
PAY_APR                           -2
BIL_AMT_SEP                     3913
BIL_AMT_AUG                     3102
BIL_AMT_JUL                      689
BIL_AMT_JUN                        0
BIL_AMT_MAY                        0
BIL_AMT_APR                        0
PAY_AMT_SEP                        0
PAY_AMT_AUG                      689
PAY_AMT_JUL                        0
PAY_AMT_JUN                        0
PAY_AMT_MAY                        0
PAY_AMT_APR                        0
DEFAULT                      default
SEX_female                         1
SEX_male                           0
EDUCATION_graduate school          0
EDUCATION_high school              0
EDUCATION_other                    0
EDUCATION_university               1
MARRIAGE_divorce                   0
MARRIAGE_married                   1
MARRIAGE_others                    0
MARRIAGE_single                    0
Name: 0, dtype: object

In [ ]:
#Add columns to keep verbose values, even after the dummy variables creation
columns=['SEX', 'EDUCATION', 'MARRIAGE']
for c in columns:
    df[f'{c}_V'] = df[f'{c}']
df = pd.get_dummies(data=df, columns=columns)
df.iloc[0]

In [14]:
#Set default to a numeric field
defaultDict = {'default':1,
               'not default': 0}
for k, v in defaultDict.items():
    df.loc[df['DEFAULT_NUM'] == k, 'DEFAULT'] = v
df

,LIMIT_BAL,AGE,PAY_SEP,PAY_AUG,PAY_JUL,PAY_JUN,PAY_MAY,PAY_APR,BIL_AMT_SEP,BIL_AMT_AUG,...,SEX_female,SEX_male,EDUCATION_graduate school,EDUCATION_high school,EDUCATION_other,EDUCATION_university,MARRIAGE_divorce,MARRIAGE_married,MARRIAGE_others,MARRIAGE_single
0,20000,24,2,2,-1,-1,-2,-2,3913,3102,...,1,0,0,0,0,1,0,1,0,0
1,120000,26,-1,2,0,0,0,2,2682,1725,...,1,0,0,0,0,1,0,0,0,1
2,90000,34,0,0,0,0,0,0,29239,14027,...,1,0,0,0,0,1,0,0,0,1
3,50000,37,0,0,0,0,0,0,46990,48233,...,1,0,0,0,0,1,0,1,0,0
4,50000,57,-1,0,-1,0,0,0,8617,5670,...,0,1,0,0,0,1,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,220000,39,0,0,0,0,0,0,188948,192815,...,0,1,0,1,0,0,0,1,0,0
29996,150000,43,-1,-1,-1,-1,0,0,1683,1828,...,0,1,0,1,0,0,0,0,0,1
29997,30000,37,4,3,2,-1,0,0,3565,3356,...,0,1,0,0,0,1,0,0,0,1
29998,80000,41,1,-1,0,0,0,-1,-1645,78379,...,0,1,0,1,0,0,0,1,0,0
29999,50000,46,0,0,0,0,0,0,47929,48905,...,0,1,0,0,0,1,0,1,0,0

In [15]:
df.iloc[0]

LIMIT_BAL                    20000
AGE                             24
PAY_SEP                          2
PAY_AUG                          2
PAY_JUL                         -1
PAY_JUN                         -1
PAY_MAY                         -2
PAY_APR                         -2
BIL_AMT_SEP                   3913
BIL_AMT_AUG                   3102
BIL_AMT_JUL                    689
BIL_AMT_JUN                      0
BIL_AMT_MAY                      0
BIL_AMT_APR                      0
PAY_AMT_SEP                      0
PAY_AMT_AUG                    689
PAY_AMT_JUL                      0
PAY_AMT_JUN                      0
PAY_AMT_MAY                      0
PAY_AMT_APR                      0
DEFAULT                          1
SEX_female                       1
SEX_male                         0
EDUCATION_graduate school        0
EDUCATION_high school            0
EDUCATION_other                  0
EDUCATION_university             1
MARRIAGE_divorce                 0
MARRIAGE_married                 1
MARRIAGE_others                  0
MARRIAGE_single                  0
Name: 0, dtype: object

In [16]:
#Create dummy variables for No consumption, Paid in full, and revolving credit use. These variables are contained in the variables PAY_<MONTH>.
months = ['APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP']
NO_CONSUMPTION = -2
PAID_FULL = -1
REVOLVING_USE = 0
for m in months:
    df[f'NO_CONS_{m}'] = (df[f'PAY_{m}'] == NO_CONSUMPTION).astype(int)
    df[f'PAID_FULL_{m}'] = (df[f'PAY_{m}'] == PAID_FULL).astype(int)
    df[f'REVOLVING_USE_{m}'] = (df[f'PAY_{m}'] == REVOLVING_USE).astype(int)
df

,LIMIT_BAL,AGE,PAY_SEP,PAY_AUG,PAY_JUL,PAY_JUN,PAY_MAY,PAY_APR,BIL_AMT_SEP,BIL_AMT_AUG,...,REVOLVING_USE_JUN,NO_CONS_JUL,PAID_FULL_JUL,REVOLVING_USE_JUL,NO_CONS_AUG,PAID_FULL_AUG,REVOLVING_USE_AUG,NO_CONS_SEP,PAID_FULL_SEP,REVOLVING_USE_SEP
0,20000,24,2,2,-1,-1,-2,-2,3913,3102,...,0,0,1,0,0,0,0,0,0,0
1,120000,26,-1,2,0,0,0,2,2682,1725,...,1,0,0,1,0,0,0,0,1,0
2,90000,34,0,0,0,0,0,0,29239,14027,...,1,0,0,1,0,0,1,0,0,1
3,50000,37,0,0,0,0,0,0,46990,48233,...,1,0,0,1,0,0,1,0,0,1
4,50000,57,-1,0,-1,0,0,0,8617,5670,...,1,0,1,0,0,0,1,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,220000,39,0,0,0,0,0,0,188948,192815,...,1,0,0,1,0,0,1,0,0,1
29996,150000,43,-1,-1,-1,-1,0,0,1683,1828,...,0,0,1,0,0,1,0,0,1,0
29997,30000,37,4,3,2,-1,0,0,3565,3356,...,0,0,0,0,0,0,0,0,0,0
29998,80000,41,1,-1,0,0,0,-1,-1645,78379,...,1,0,0,1,0,1,0,0,0,0
29999,50000,46,0,0,0,0,0,0,47929,48905,...,1,0,0,1,0,0,1,0,0,1

In [21]:
#Create variable for number of months in delay per month
months = ['APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP']
for m in months:
    df[f'PAY_DELAY_{m}'] = df[f'PAY_{m}'].apply(lambda x: max(x, 0))
df

,LIMIT_BAL,AGE,PAY_SEP,PAY_AUG,PAY_JUL,PAY_JUN,PAY_MAY,PAY_APR,BIL_AMT_SEP,BIL_AMT_AUG,...,REVOLVING_USE_AUG,NO_CONS_SEP,PAID_FULL_SEP,REVOLVING_USE_SEP,PAY_DELAY_APR,PAY_DELAY_MAY,PAY_DELAY_JUN,PAY_DELAY_JUL,PAY_DELAY_AUG,PAY_DELAY_SEP
0,20000,24,2,2,-1,-1,-2,-2,3913,3102,...,0,0,0,0,0,0,0,0,2,2
1,120000,26,-1,2,0,0,0,2,2682,1725,...,0,0,1,0,2,0,0,0,2,0
2,90000,34,0,0,0,0,0,0,29239,14027,...,1,0,0,1,0,0,0,0,0,0
3,50000,37,0,0,0,0,0,0,46990,48233,...,1,0,0,1,0,0,0,0,0,0
4,50000,57,-1,0,-1,0,0,0,8617,5670,...,1,0,1,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,220000,39,0,0,0,0,0,0,188948,192815,...,1,0,0,1,0,0,0,0,0,0
29996,150000,43,-1,-1,-1,-1,0,0,1683,1828,...,0,0,1,0,0,0,0,0,0,0
29997,30000,37,4,3,2,-1,0,0,3565,3356,...,0,0,0,0,0,0,0,2,3,4
29998,80000,41,1,-1,0,0,0,-1,-1645,78379,...,0,0,0,0,0,0,0,0,0,1
29999,50000,46,0,0,0,0,0,0,47929,48905,...,1,0,0,1,0,0,0,0,0,0

In [17]:
df.iloc[0]

LIMIT_BAL                    20000
AGE                             24
PAY_SEP                          2
PAY_AUG                          2
PAY_JUL                         -1
PAY_JUN                         -1
PAY_MAY                         -2
PAY_APR                         -2
BIL_AMT_SEP                   3913
BIL_AMT_AUG                   3102
BIL_AMT_JUL                    689
BIL_AMT_JUN                      0
BIL_AMT_MAY                      0
BIL_AMT_APR                      0
PAY_AMT_SEP                      0
PAY_AMT_AUG                    689
PAY_AMT_JUL                      0
PAY_AMT_JUN                      0
PAY_AMT_MAY                      0
PAY_AMT_APR                      0
DEFAULT                          1
SEX_female                       1
SEX_male                         0
EDUCATION_graduate school        0
EDUCATION_high school            0
EDUCATION_other                  0
EDUCATION_university             1
MARRIAGE_divorce                 0
MARRIAGE_married                 1
MARRIAGE_others                  0
MARRIAGE_single                  0
NO_CONS_APR                      1
PAID_FULL_APR                    0
REVOLVING_USE_APR                0
NO_CONS_MAY                      1
PAID_FULL_MAY                    0
REVOLVING_USE_MAY                0
NO_CONS_JUN                      0
PAID_FULL_JUN                    1
REVOLVING_USE_JUN                0
NO_CONS_JUL                      0
PAID_FULL_JUL                    1
REVOLVING_USE_JUL                0
NO_CONS_AUG                      0
PAID_FULL_AUG                    0
REVOLVING_USE_AUG                0
NO_CONS_SEP                      0
PAID_FULL_SEP                    0
REVOLVING_USE_SEP                0
Name: 0, dtype: object

In [24]:
profile = pandas_profiling.ProfileReport(df)
profile.to_file("reportProfile.html")

Summarize dataset: 100%|██████████| 744/744 [02:05<00:00,  5.94it/s, Completed]
Generate report structure: 100%|██████████| 1/1 [00:18<00:00, 18.99s/it]
Render HTML: 100%|██████████| 1/1 [00:17<00:00, 17.18s/it]
Export report to file: 100%|██████████| 1/1 [00:00<00:00,  8.09it/s]